app/controllers/favourites_controller.rb

  def create
    @movie.favourites.create!(user:current_user)
---
INSERT INTO "favourites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 08 Mar 2014 12:24:59 UTC +00:00], ["movie_id", 1], ["updated_at", Sat, 08 Mar 2014 12:24:59 UTC +00:00], ["user_id", 8]]

  def destroy
    favourite = Favourite.find(params[:id])
    favourite.destroy
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "favourites" WHERE "favourites"."id" = ?  [["id", 3]]

  def set_movie
    @movie = Movie.find_by(slug: params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."slug" = 'batman-vs-godzilla' LIMIT 1