app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "favourites".* FROM "favourites" WHERE "favourites"."movie_id" = ? AND "favourites"."user_id" = 9 LIMIT 1  [["movie_id", 1]]
---
  def show
    @movie = Movie.find(params[:id])
    @fans = @movie.fans
    @genres = @movie.genres

    if(current_user)
      @user_already_favourite = @movie.favourites.find_by(user_id: current_user.id)