app/controllers/movies_controller.rb

  def set_movie
    @movie = Movie.find_by(slug: params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."slug" = 'batman-vs-godzilla' LIMIT 1