app/controllers/reviews_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."slug" = 'spider-man' LIMIT 1
---
		def set_movie
			@movie_rev = Movie.find_by(slug: params[:movie_id])