app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Lovey movie"], ["created_at", Sat, 08 Mar 2014 02:09:03 UTC +00:00], ["movie_id", 6], ["stars", 3], ["updated_at", Sat, 08 Mar 2014 02:09:03 UTC +00:00], ["user_id", 7]]
---
	def create
		@review = @movie_rev.reviews.new(review_params)
		if @review.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]
---
		def set_movie
			@movie_rev = Movie.find(params[:movie_id])