app/controllers/sessions_controller.rb

  def create
    usermail = params[:email]
    userpwd = params[:password]
    if usermail.empty? || userpwd.empty?
      flash.now[:notice] = "Please enter user details to sign in"
      render :new
    else
      user = User.find_by(email:usermail) || User.find_by(username:usermail)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'songster.sa@gmail.com' LIMIT 1