app/controllers/users_controller.rb

	def update
		if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "username" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "sp"], ["username", "sp"], ["updated_at", Fri, 07 Mar 2014 23:51:40 UTC +00:00]]